docs/images/dependencies.dot
digraph {
              fontname="Helvetica,Arial,sans-serif"
              node [
                  style=filled
                  shape=box
                  fontname="Helvetica,Arial,sans-serif"
                  fontsize=10
                  color="#b2afa7"
                  fillcolor="#edeceb"
              ]
              edge [
                  headport=nw
                  fontname="Helvetica,Arial,sans-serif"
                  fontsize=8
                  color="#b2b1ae"
                  fontcolor="#00000080"
              ]
	"click-extra" [label="click-extra\n3.8.0"]
	"click-extra" -> "pygments-ansi-color" [label=">=0.0.6,<0.1.1"]
	"click-extra" -> click [label=">=8.1.1,<9.0.0"]
	"click-extra" -> tabulate [label=">=0.9.0,<0.10.0"]
	"click-extra" -> regex [label=">=2022.3.15,<2023.0.0"]
	"click-extra" -> sphinx [label=">=5.3.0,<6.0.0"]
	"click-extra" -> requests [label=">=2.27.1,<3.0.0"]
	"click-extra" -> wcmatch [label=">=8.4,<9.0"]
	"click-extra" -> "pallets-sphinx-themes" [label=">=2.0.2,<3.0.0"]
	"click-extra" -> boltons [label=">=21.0.0,<22.0.0"]
	"click-extra" -> "click-log" [label=">=0.4.0,<0.5.0"]
	"click-extra" -> cloup [label=">=2.0.0.post1,<3.0.0"]
	"click-extra" -> pyyaml [label=">=6.0.0,<7.0.0"]
	"click-extra" -> pygments [label=">=2.14.0,<3.0.0"]
	"click-extra" -> commentjson [label=">=0.9.0,<0.10.0"]
	"click-extra" -> xmltodict [label=">=0.12,<0.14"]
	"click-extra" -> mergedeep [label=">=1.3.4,<2.0.0"]
	mergedeep [label="mergedeep\n1.3.4"]
	xmltodict [label="xmltodict\n0.13.0"]
	commentjson [label="commentjson\n0.9.0"]
	commentjson -> "lark-parser" [label=">=0.7.1,<0.8.0"]
	"lark-parser" [label="lark-parser\n0.7.8"]
	pygments [label="Pygments\n2.14.0"]
	pyyaml [label="PyYAML\n6.0"]
	cloup [label="cloup\n2.0.0.post1"]
	cloup -> click [label=">=8.0,<9.0"]
	click [label="click\n8.1.3"]
	"click-log" [label="click-log\n0.4.0"]
	"click-log" -> click [label=any]
	boltons [label="boltons\n21.0.0"]
	"pallets-sphinx-themes" [label="Pallets-Sphinx-Themes\n2.0.3"]
	"pallets-sphinx-themes" -> packaging [label=any]
	"pallets-sphinx-themes" -> sphinx [label=any]
	sphinx [label="sphinx\n5.3.0"]
	sphinx -> docutils [label=">=0.14,<0.20"]
	sphinx -> "sphinxcontrib-htmlhelp" [label=">=2.0.0"]
	sphinx -> pygments [label=">=2.12"]
	sphinx -> snowballstemmer [label=">=2.0"]
	sphinx -> packaging [label=">=21.0"]
	sphinx -> "sphinxcontrib-qthelp" [label=any]
	sphinx -> imagesize [label=">=1.3"]
	sphinx -> "sphinxcontrib-serializinghtml" [label=">=1.1.5"]
	sphinx -> "sphinxcontrib-devhelp" [label=any]
	sphinx -> "sphinxcontrib-applehelp" [label=any]
	sphinx -> "sphinxcontrib-jsmath" [label=any]
	sphinx -> jinja2 [label=">=3.0"]
	sphinx -> babel [label=">=2.9"]
	sphinx -> alabaster [label=">=0.7,<0.8"]
	sphinx -> requests [label=">=2.5.0"]
	requests [label="requests\n2.28.1"]
	requests -> certifi [label=">=2017.4.17"]
	requests -> urllib3 [label=">=1.21.1,<1.27"]
	requests -> "charset-normalizer" [label=">=2,<3"]
	requests -> idna [label=">=2.5,<4"]
	idna [label="idna\n3.4"]
	"charset-normalizer" [label="charset-normalizer\n2.1.1"]
	urllib3 [label="urllib3\n1.26.13"]
	certifi [label="certifi\n2022.12.7"]
	alabaster [label="alabaster\n0.7.12"]
	babel [label="Babel\n2.11.0"]
	babel -> pytz [label=">=2015.7"]
	pytz [label="pytz\n2022.7"]
	jinja2 [label="Jinja2\n3.1.2"]
	jinja2 -> markupsafe [label=">=2.0"]
	markupsafe [label="MarkupSafe\n2.1.1"]
	"sphinxcontrib-jsmath" [label="sphinxcontrib-jsmath\n1.0.1"]
	"sphinxcontrib-applehelp" [label="sphinxcontrib-applehelp\n1.0.2"]
	"sphinxcontrib-devhelp" [label="sphinxcontrib-devhelp\n1.0.2"]
	"sphinxcontrib-serializinghtml" [label="sphinxcontrib-serializinghtml\n1.1.5"]
	imagesize [label="imagesize\n1.4.1"]
	"sphinxcontrib-qthelp" [label="sphinxcontrib-qthelp\n1.0.3"]
	packaging [label="packaging\n23.0"]
	snowballstemmer [label="snowballstemmer\n2.2.0"]
	"sphinxcontrib-htmlhelp" [label="sphinxcontrib-htmlhelp\n2.0.0"]
	docutils [label="docutils\n0.19"]
	wcmatch [label="wcmatch\n8.4.1"]
	wcmatch -> bracex [label=">=2.1.1"]
	bracex [label="bracex\n2.3.post1"]
	regex [label="regex\n2022.10.31"]
	tabulate [label="tabulate\n0.9.0"]
	"pygments-ansi-color" [label="pygments-ansi-color\n0.1.0"]
	"pygments-ansi-color" -> pygments [label="!=2.7.3"]
}
